[Killed] BooleanLiteral
js/quality/final-evidence-gate.js:10:20
   solverSamples: 50_000,
   optionSamples: 10_000,
   mutationScorePercent: 90,
-  fullE2ERequired: true,
+  fullE2ERequired: false,
   childMindStructuredBandsRequired: true
 });
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.4902

[Killed] BooleanLiteral
js/quality/final-evidence-gate.js:11:37
   optionSamples: 10_000,
   mutationScorePercent: 90,
   fullE2ERequired: true,
-  childMindStructuredBandsRequired: true
+  childMindStructuredBandsRequired: false
 });
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.6428

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:15:18
 });
 
 export function evaluateFinalEvidence(index = {}) {
-  const actual = index.actual || {};
+  const actual = false;
   const targets = { ...FINAL_EVIDENCE_TARGETS, ...(index.targets || {}) };
   const gaps = [];
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.5031

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:15:18
 });
 
 export function evaluateFinalEvidence(index = {}) {
-  const actual = index.actual || {};
+  const actual = true;
   const targets = { ...FINAL_EVIDENCE_TARGETS, ...(index.targets || {}) };
   const gaps = [];
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.5332

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:16:52
 
 export function evaluateFinalEvidence(index = {}) {
   const actual = index.actual || {};
-  const targets = { ...FINAL_EVIDENCE_TARGETS, ...(index.targets || {}) };
+  const targets = { ...FINAL_EVIDENCE_TARGETS, ...(true) };
   const gaps = [];
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.8297

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:16:52
 
 export function evaluateFinalEvidence(index = {}) {
   const actual = index.actual || {};
-  const targets = { ...FINAL_EVIDENCE_TARGETS, ...(index.targets || {}) };
+  const targets = { ...FINAL_EVIDENCE_TARGETS, ...(false) };
   const gaps = [];
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.8106

[Killed] LogicalOperator
js/quality/final-evidence-gate.js:19:30
   const targets = { ...FINAL_EVIDENCE_TARGETS, ...(index.targets || {}) };
   const gaps = [];
 
-  const minSessions = Number(actual.minSessionsPerGame ?? 0);
+  const minSessions = Number(actual.minSessionsPerGame && 0);
   if (minSessions < targets.sessionsPerGame) {
     gaps.push(`sessions:${minSessions}/${targets.sessionsPerGame}`);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.3107

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:20:7
   const gaps = [];
 
   const minSessions = Number(actual.minSessionsPerGame ?? 0);
-  if (minSessions < targets.sessionsPerGame) {
+  if (true) {
     gaps.push(`sessions:${minSessions}/${targets.sessionsPerGame}`);
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 5.7322

[Killed] EqualityOperator
js/quality/final-evidence-gate.js:20:7
   const gaps = [];
 
   const minSessions = Number(actual.minSessionsPerGame ?? 0);
-  if (minSessions < targets.sessionsPerGame) {
+  if (minSessions >= targets.sessionsPerGame) {
     gaps.push(`sessions:${minSessions}/${targets.sessionsPerGame}`);
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.2933

[Killed] LogicalOperator
js/quality/final-evidence-gate.js:23:26
   if (minSessions < targets.sessionsPerGame) {
     gaps.push(`sessions:${minSessions}/${targets.sessionsPerGame}`);
   }
-  const gamesOk = Number(actual.gamesMeetingSessionTarget ?? 0);
+  const gamesOk = Number(actual.gamesMeetingSessionTarget && 0);
   if (gamesOk < targets.activeGames) {
     gaps.push(`games_with_500:${gamesOk}/${targets.activeGames}`);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.8551

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:24:7
     gaps.push(`sessions:${minSessions}/${targets.sessionsPerGame}`);
   }
   const gamesOk = Number(actual.gamesMeetingSessionTarget ?? 0);
-  if (gamesOk < targets.activeGames) {
+  if (false) {
     gaps.push(`games_with_500:${gamesOk}/${targets.activeGames}`);
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.6081

[Killed] BlockStatement
js/quality/final-evidence-gate.js:24:38
     gaps.push(`sessions:${minSessions}/${targets.sessionsPerGame}`);
   }
   const gamesOk = Number(actual.gamesMeetingSessionTarget ?? 0);
-  if (gamesOk < targets.activeGames) {
-    gaps.push(`games_with_500:${gamesOk}/${targets.activeGames}`);
-  }
+  if (gamesOk < targets.activeGames) {}
   const solver = Number(actual.solverSamples ?? 0);
   if (solver < targets.solverSamples) gaps.push(`solver:${solver}/${targets.solverSamples}`);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 8.4536

[Killed] LogicalOperator
js/quality/final-evidence-gate.js:27:25
   if (gamesOk < targets.activeGames) {
     gaps.push(`games_with_500:${gamesOk}/${targets.activeGames}`);
   }
-  const solver = Number(actual.solverSamples ?? 0);
+  const solver = Number(actual.solverSamples && 0);
   if (solver < targets.solverSamples) gaps.push(`solver:${solver}/${targets.solverSamples}`);
   const options = Number(actual.optionSamples ?? 0);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 35.5472

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:28:7
     gaps.push(`games_with_500:${gamesOk}/${targets.activeGames}`);
   }
   const solver = Number(actual.solverSamples ?? 0);
-  if (solver < targets.solverSamples) gaps.push(`solver:${solver}/${targets.solverSamples}`);
+  if (true) gaps.push(`solver:${solver}/${targets.solverSamples}`);
   const options = Number(actual.optionSamples ?? 0);
   if (options < targets.optionSamples) gaps.push(`options:${options}/${targets.optionSamples}`);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 34.7838

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:28:7
     gaps.push(`games_with_500:${gamesOk}/${targets.activeGames}`);
   }
   const solver = Number(actual.solverSamples ?? 0);
-  if (solver < targets.solverSamples) gaps.push(`solver:${solver}/${targets.solverSamples}`);
+  if (false) gaps.push(`solver:${solver}/${targets.solverSamples}`);
   const options = Number(actual.optionSamples ?? 0);
   if (options < targets.optionSamples) gaps.push(`options:${options}/${targets.optionSamples}`);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable
ok 1 - choice integrity: non-choice not applicable
  ---
  duration_ms: 3.4347
  ...
# Subtest: choice integrity: option count and answer index

[Killed] LogicalOperator
js/quality/final-evidence-gate.js:29:26
   }
   const solver = Number(actual.solverSamples ?? 0);
   if (solver < targets.solverSamples) gaps.push(`solver:${solver}/${targets.solverSamples}`);
-  const options = Number(actual.optionSamples ?? 0);
+  const options = Number(actual.optionSamples && 0);
   if (options < targets.optionSamples) gaps.push(`options:${options}/${targets.optionSamples}`);
   const mutation = Number(actual.mutationScorePercent ?? 0);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.1942

[Killed] EqualityOperator
js/quality/final-evidence-gate.js:30:7
   const solver = Number(actual.solverSamples ?? 0);
   if (solver < targets.solverSamples) gaps.push(`solver:${solver}/${targets.solverSamples}`);
   const options = Number(actual.optionSamples ?? 0);
-  if (options < targets.optionSamples) gaps.push(`options:${options}/${targets.optionSamples}`);
+  if (options <= targets.optionSamples) gaps.push(`options:${options}/${targets.optionSamples}`);
   const mutation = Number(actual.mutationScorePercent ?? 0);
   if (mutation < targets.mutationScorePercent) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.397

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:30:7
   const solver = Number(actual.solverSamples ?? 0);
   if (solver < targets.solverSamples) gaps.push(`solver:${solver}/${targets.solverSamples}`);
   const options = Number(actual.optionSamples ?? 0);
-  if (options < targets.optionSamples) gaps.push(`options:${options}/${targets.optionSamples}`);
+  if (false) gaps.push(`options:${options}/${targets.optionSamples}`);
   const mutation = Number(actual.mutationScorePercent ?? 0);
   if (mutation < targets.mutationScorePercent) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.1791

[Killed] LogicalOperator
js/quality/final-evidence-gate.js:31:27
   if (solver < targets.solverSamples) gaps.push(`solver:${solver}/${targets.solverSamples}`);
   const options = Number(actual.optionSamples ?? 0);
   if (options < targets.optionSamples) gaps.push(`options:${options}/${targets.optionSamples}`);
-  const mutation = Number(actual.mutationScorePercent ?? 0);
+  const mutation = Number(actual.mutationScorePercent && 0);
   if (mutation < targets.mutationScorePercent) {
     gaps.push(`mutation:${mutation}/${targets.mutationScorePercent}`);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.6481

[Killed] BlockStatement
js/quality/final-evidence-gate.js:32:48
   const options = Number(actual.optionSamples ?? 0);
   if (options < targets.optionSamples) gaps.push(`options:${options}/${targets.optionSamples}`);
   const mutation = Number(actual.mutationScorePercent ?? 0);
-  if (mutation < targets.mutationScorePercent) {
-    gaps.push(`mutation:${mutation}/${targets.mutationScorePercent}`);
-  }
+  if (mutation < targets.mutationScorePercent) {}
   if (actual.fullE2E !== true) gaps.push('full_e2e_missing');
   if (actual.childMindStructuredBands !== true) gaps.push('child_mind_structured_bands_missing');
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.4647

[Killed] EqualityOperator
js/quality/final-evidence-gate.js:32:7
   const options = Number(actual.optionSamples ?? 0);
   if (options < targets.optionSamples) gaps.push(`options:${options}/${targets.optionSamples}`);
   const mutation = Number(actual.mutationScorePercent ?? 0);
-  if (mutation < targets.mutationScorePercent) {
+  if (mutation >= targets.mutationScorePercent) {
     gaps.push(`mutation:${mutation}/${targets.mutationScorePercent}`);
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.0179

[Killed] EqualityOperator
js/quality/final-evidence-gate.js:35:7
   if (mutation < targets.mutationScorePercent) {
     gaps.push(`mutation:${mutation}/${targets.mutationScorePercent}`);
   }
-  if (actual.fullE2E !== true) gaps.push('full_e2e_missing');
+  if (actual.fullE2E === true) gaps.push('full_e2e_missing');
   if (actual.childMindStructuredBands !== true) gaps.push('child_mind_structured_bands_missing');
   if (Number(actual.underfillCount ?? 0) > 0) gaps.push(`underfill:${actual.underfillCount}`);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.6135

[Killed] BooleanLiteral
js/quality/final-evidence-gate.js:35:26
   if (mutation < targets.mutationScorePercent) {
     gaps.push(`mutation:${mutation}/${targets.mutationScorePercent}`);
   }
-  if (actual.fullE2E !== true) gaps.push('full_e2e_missing');
+  if (actual.fullE2E !== false) gaps.push('full_e2e_missing');
   if (actual.childMindStructuredBands !== true) gaps.push('child_mind_structured_bands_missing');
   if (Number(actual.underfillCount ?? 0) > 0) gaps.push(`underfill:${actual.underfillCount}`);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 9.2313

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:36:7
     gaps.push(`mutation:${mutation}/${targets.mutationScorePercent}`);
   }
   if (actual.fullE2E !== true) gaps.push('full_e2e_missing');
-  if (actual.childMindStructuredBands !== true) gaps.push('child_mind_structured_bands_missing');
+  if (true) gaps.push('child_mind_structured_bands_missing');
   if (Number(actual.underfillCount ?? 0) > 0) gaps.push(`underfill:${actual.underfillCount}`);
   if (Number(actual.sessionSemanticRepeatCount ?? 0) > 0) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.1697

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:36:7
     gaps.push(`mutation:${mutation}/${targets.mutationScorePercent}`);
   }
   if (actual.fullE2E !== true) gaps.push('full_e2e_missing');
-  if (actual.childMindStructuredBands !== true) gaps.push('child_mind_structured_bands_missing');
+  if (false) gaps.push('child_mind_structured_bands_missing');
   if (Number(actual.underfillCount ?? 0) > 0) gaps.push(`underfill:${actual.underfillCount}`);
   if (Number(actual.sessionSemanticRepeatCount ?? 0) > 0) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.0184

[Killed] EqualityOperator
js/quality/final-evidence-gate.js:37:7
   }
   if (actual.fullE2E !== true) gaps.push('full_e2e_missing');
   if (actual.childMindStructuredBands !== true) gaps.push('child_mind_structured_bands_missing');
-  if (Number(actual.underfillCount ?? 0) > 0) gaps.push(`underfill:${actual.underfillCount}`);
+  if (Number(actual.underfillCount ?? 0) >= 0) gaps.push(`underfill:${actual.underfillCount}`);
   if (Number(actual.sessionSemanticRepeatCount ?? 0) > 0) {
     gaps.push(`semantic_repeat:${actual.sessionSemanticRepeatCount}`);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.1425

[Killed] EqualityOperator
js/quality/final-evidence-gate.js:37:7
   }
   if (actual.fullE2E !== true) gaps.push('full_e2e_missing');
   if (actual.childMindStructuredBands !== true) gaps.push('child_mind_structured_bands_missing');
-  if (Number(actual.underfillCount ?? 0) > 0) gaps.push(`underfill:${actual.underfillCount}`);
+  if (Number(actual.underfillCount ?? 0) <= 0) gaps.push(`underfill:${actual.underfillCount}`);
   if (Number(actual.sessionSemanticRepeatCount ?? 0) > 0) {
     gaps.push(`semantic_repeat:${actual.sessionSemanticRepeatCount}`);
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.3111

[Killed] BlockStatement
js/quality/final-evidence-gate.js:38:59
   if (actual.fullE2E !== true) gaps.push('full_e2e_missing');
   if (actual.childMindStructuredBands !== true) gaps.push('child_mind_structured_bands_missing');
   if (Number(actual.underfillCount ?? 0) > 0) gaps.push(`underfill:${actual.underfillCount}`);
-  if (Number(actual.sessionSemanticRepeatCount ?? 0) > 0) {
-    gaps.push(`semantic_repeat:${actual.sessionSemanticRepeatCount}`);
-  }
+  if (Number(actual.sessionSemanticRepeatCount ?? 0) > 0) {}
 
   const adequate = gaps.length === 0;
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.4761

[Killed] EqualityOperator
js/quality/final-evidence-gate.js:38:7
   if (actual.fullE2E !== true) gaps.push('full_e2e_missing');
   if (actual.childMindStructuredBands !== true) gaps.push('child_mind_structured_bands_missing');
   if (Number(actual.underfillCount ?? 0) > 0) gaps.push(`underfill:${actual.underfillCount}`);
-  if (Number(actual.sessionSemanticRepeatCount ?? 0) > 0) {
+  if (Number(actual.sessionSemanticRepeatCount ?? 0) <= 0) {
     gaps.push(`semantic_repeat:${actual.sessionSemanticRepeatCount}`);
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.6753

[Killed] EqualityOperator
js/quality/final-evidence-gate.js:42:20
     gaps.push(`semantic_repeat:${actual.sessionSemanticRepeatCount}`);
   }
 
-  const adequate = gaps.length === 0;
+  const adequate = gaps.length !== 0;
   return {
     adequate,
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 20.8015

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:42:20
     gaps.push(`semantic_repeat:${actual.sessionSemanticRepeatCount}`);
   }
 
-  const adequate = gaps.length === 0;
+  const adequate = false;
   return {
     adequate,
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 35.8932

[Killed] BooleanLiteral
js/quality/final-evidence-gate.js:54:35
       solverSamples: solver,
       optionSamples: options,
       mutationScorePercent: mutation,
-      fullE2E: actual.fullE2E === true,
+      fullE2E: actual.fullE2E === false,
       childMindStructuredBands: actual.childMindStructuredBands === true,
       underfillCount: Number(actual.underfillCount ?? 0),
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 6.8185

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:54:16
       solverSamples: solver,
       optionSamples: options,
       mutationScorePercent: mutation,
-      fullE2E: actual.fullE2E === true,
+      fullE2E: true,
       childMindStructuredBands: actual.childMindStructuredBands === true,
       underfillCount: Number(actual.underfillCount ?? 0),
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.5384

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:55:33
       optionSamples: options,
       mutationScorePercent: mutation,
       fullE2E: actual.fullE2E === true,
-      childMindStructuredBands: actual.childMindStructuredBands === true,
+      childMindStructuredBands: true,
       underfillCount: Number(actual.underfillCount ?? 0),
       sessionSemanticRepeatCount: Number(actual.sessionSemanticRepeatCount ?? 0),
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 8.6833

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:55:33
       optionSamples: options,
       mutationScorePercent: mutation,
       fullE2E: actual.fullE2E === true,
-      childMindStructuredBands: actual.childMindStructuredBands === true,
+      childMindStructuredBands: false,
       underfillCount: Number(actual.underfillCount ?? 0),
       sessionSemanticRepeatCount: Number(actual.sessionSemanticRepeatCount ?? 0),
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 6.5429

[Survived] LogicalOperator
js/quality/final-evidence-gate.js:56:30
       mutationScorePercent: mutation,
       fullE2E: actual.fullE2E === true,
       childMindStructuredBands: actual.childMindStructuredBands === true,
-      underfillCount: Number(actual.underfillCount ?? 0),
+      underfillCount: Number(actual.underfillCount && 0),
       sessionSemanticRepeatCount: Number(actual.sessionSemanticRepeatCount ?? 0),
       e2eSmokeOnly: Number(actual.e2eSmokeOnly ?? 0)

[Survived] LogicalOperator
js/quality/final-evidence-gate.js:57:42
       fullE2E: actual.fullE2E === true,
       childMindStructuredBands: actual.childMindStructuredBands === true,
       underfillCount: Number(actual.underfillCount ?? 0),
-      sessionSemanticRepeatCount: Number(actual.sessionSemanticRepeatCount ?? 0),
+      sessionSemanticRepeatCount: Number(actual.sessionSemanticRepeatCount && 0),
       e2eSmokeOnly: Number(actual.e2eSmokeOnly ?? 0)
     }

[Survived] LogicalOperator
js/quality/final-evidence-gate.js:58:28
       childMindStructuredBands: actual.childMindStructuredBands === true,
       underfillCount: Number(actual.underfillCount ?? 0),
       sessionSemanticRepeatCount: Number(actual.sessionSemanticRepeatCount ?? 0),
-      e2eSmokeOnly: Number(actual.e2eSmokeOnly ?? 0)
+      e2eSmokeOnly: Number(actual.e2eSmokeOnly && 0)
     }
   };

[Killed] BlockStatement
js/quality/final-evidence-gate.js:63:54
   };
 }
 
-export function assertEvidenceAllowsPass(index = {}) {
-  const verdict = evaluateFinalEvidence(index);
-  if (!verdict.adequate) {
-    return {
-      ok: false,
-      decision: 'FAIL',
-      autoReturnToStage14: true,
-      reason: 'final_evidence_inadequate',
-      gaps: verdict.gaps,
-      verdict
-    };
-  }
-  return { ok: true, decision: 'PASS', autoReturnToStage14: false, gaps: [], verdict };
-}
+export function assertEvidenceAllowsPass(index = {}) {}
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable
  ---
  duration_ms: 4.7494
  ...

[Killed] BlockStatement
js/quality/final-evidence-gate.js:65:26
 
 export function assertEvidenceAllowsPass(index = {}) {
   const verdict = evaluateFinalEvidence(index);
-  if (!verdict.adequate) {
-    return {
-      ok: false,
-      decision: 'FAIL',
-      autoReturnToStage14: true,
-      reason: 'final_evidence_inadequate',
-      gaps: verdict.gaps,
-      verdict
-    };
-  }
+  if (!verdict.adequate) {}
   return { ok: true, decision: 'PASS', autoReturnToStage14: false, gaps: [], verdict };
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 13.0375

[Killed] ConditionalExpression
js/quality/final-evidence-gate.js:65:7
 
 export function assertEvidenceAllowsPass(index = {}) {
   const verdict = evaluateFinalEvidence(index);
-  if (!verdict.adequate) {
+  if (true) {
     return {
       ok: false,
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.2182

[Killed] BooleanLiteral
js/quality/final-evidence-gate.js:67:11
   const verdict = evaluateFinalEvidence(index);
   if (!verdict.adequate) {
     return {
-      ok: false,
+      ok: true,
       decision: 'FAIL',
       autoReturnToStage14: true,
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 4.1875

[Killed] BooleanLiteral
js/quality/final-evidence-gate.js:69:28
     return {
       ok: false,
       decision: 'FAIL',
-      autoReturnToStage14: true,
+      autoReturnToStage14: false,
       reason: 'final_evidence_inadequate',
       gaps: verdict.gaps,
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 13.9341

[Killed] BooleanLiteral
js/quality/final-evidence-gate.js:75:61
       verdict
     };
   }
-  return { ok: true, decision: 'PASS', autoReturnToStage14: false, gaps: [], verdict };
+  return { ok: true, decision: 'PASS', autoReturnToStage14: true, gaps: [], verdict };
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.3774

[Killed] BooleanLiteral
js/quality/final-evidence-gate.js:75:16
       verdict
     };
   }
-  return { ok: true, decision: 'PASS', autoReturnToStage14: false, gaps: [], verdict };
+  return { ok: false, decision: 'PASS', autoReturnToStage14: false, gaps: [], verdict };
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: choice integrity: non-choice not applicable

ok 1 - choice integrity: non-choice not applicable

  ---
  duration_ms: 3.959
